// 2022-11-30 11:24

 if ($response.statusCode != 200) {
  $done(null);
}

 const flags = new Map([
  ["AC", "🇦🇨"], ["AD", "🇦🇩"], ["AE", "🇦🇪"], ["AF", "🇦🇫"], ["AG", "🇦🇬"], ["AI", "🇦🇮"], ["AL", "🇦🇱"], ["AM", "🇦🇲"], ["AO", "🇦🇴"], ["AQ", "🇦🇶"],
  ["AR", "🇦🇷"], ["AS", "🇦🇸"], ["AT", "🇦🇹"], ["AU", "🇦🇺"], ["AW", "🇦🇼"], ["AX", "🇦🇽"], ["AZ", "🇦🇿"], ["BA", "🇧🇦"], ["BB", "🇧🇧"], ["BD", "🇧🇩"],
  ["BE", "🇧🇪"], ["BF", "🇧🇫"], ["BG", "🇧🇬"], ["BH", "🇧🇭"], ["BI", "🇧🇮"], ["BJ", "🇧🇯"], ["BL", "🇧🇱"], ["BM", "🇧🇲"], ["BN", "🇧🇳"], ["BO", "🇧🇴"],
  ["BQ", "🇧🇶"], ["BR", "🇧🇷"], ["BS", "🇧🇸"], ["BT", "🇧🇹"], ["BV", "🇧🇻"], ["BW", "🇧🇼"], ["BY", "🇧🇾"], ["BZ", "🇧🇿"], ["CA", "🇨🇦"], ["CC", "🇨🇨"],
  ["CD", "🇨🇩"], ["CF", "🇨🇫"], ["CG", "🇨🇬"], ["CH", "🇨🇭"], ["CI", "🇨🇮"], ["CK", "🇨🇰"], ["CL", "🇨🇱"], ["CM", "🇨🇲"], ["CN", "🇨🇳"], ["CO", "🇨🇴"],
  ["CP", "🇨🇵"], ["CR", "🇨🇷"], ["CU", "🇨🇺"], ["CV", "🇨🇻"], ["CW", "🇨🇼"], ["CX", "🇨🇽"], ["CY", "🇨🇾"], ["CZ", "🇨🇿"], ["DE", "🇩🇪"], ["DG", "🇩🇬"],
  ["DJ", "🇩🇯"], ["DK", "🇩🇰"], ["DM", "🇩🇲"], ["DO", "🇩🇴"], ["DZ", "🇩🇿"], ["EA", "🇪🇦"], ["EC", "🇪🇨"], ["EE", "🇪🇪"], ["EG", "🇪🇬"], ["EH", "🇪🇭"],
  ["ER", "🇪🇷"], ["ES", "🇪🇸"], ["ET", "🇪🇹"], ["EU", "🇪🇺"], ["FI", "🇫🇮"], ["FJ", "🇫🇯"], ["FK", "🇫🇰"], ["FM", "🇫🇲"], ["FO", "🇫🇴"], ["FR", "🇫🇷"],
  ["GA", "🇬🇦"], ["GB", "🇬🇧"], ["GD", "🇬🇩"], ["GE", "🇬🇪"], ["GF", "🇬🇫"], ["GG", "🇬🇬"], ["GH", "🇬🇭"], ["GI", "🇬🇮"], ["GL", "🇬🇱"], ["GM", "🇬🇲"],
  ["GN", "🇬🇳"], ["GP", "🇬🇵"], ["GQ", "🇬🇶"], ["GR", "🇬🇷"], ["GS", "🇬🇸"], ["GT", "🇬🇹"], ["GU", "🇬🇺"], ["GW", "🇬🇼"], ["GY", "🇬🇾"], ["HK", "🇭🇰"],
  ["HM", "🇭🇲"], ["HN", "🇭🇳"], ["HR", "🇭🇷"], ["HT", "🇭🇹"], ["HU", "🇭🇺"], ["IC", "🇮🇨"], ["ID", "🇮🇩"], ["IE", "🇮🇪"], ["IL", "🇮🇱"], ["IM", "🇮🇲"],
  ["IN", "🇮🇳"], ["IO", "🇮🇴"], ["IQ", "🇮🇶"], ["IR", "🇮🇷"], ["IS", "🇮🇸"], ["IT", "🇮🇹"], ["JE", "🇯🇪"], ["JM", "🇯🇲"], ["JO", "🇯🇴"], ["JP", "🇯🇵"],
  ["KE", "🇰🇪"], ["KG", "🇰🇬"], ["KH", "🇰🇭"], ["KI", "🇰🇮"], ["KM", "🇰🇲"], ["KN", "🇰🇳"], ["KP", "🇰🇵"], ["KR", "🇰🇷"], ["KW", "🇰🇼"], ["KY", "🇰🇾"],
  ["KZ", "🇰🇿"], ["LA", "🇱🇦"], ["LB", "🇱🇧"], ["LC", "🇱🇨"], ["LI", "🇱🇮"], ["LK", "🇱🇰"], ["LR", "🇱🇷"], ["LS", "🇱🇸"], ["LT", "🇱🇹"], ["LU", "🇱🇺"],
  ["LV", "🇱🇻"], ["LY", "🇱🇾"], ["MA", "🇲🇦"], ["MC", "🇲🇨"], ["MD", "🇲🇩"], ["ME", "🇲🇪"], ["MF", "🇲🇫"], ["MG", "🇲🇬"], ["MH", "🇲🇭"], ["MK", "🇲🇰"],
  ["ML", "🇲🇱"], ["MM", "🇲🇲"], ["MN", "🇲🇳"], ["MO", "🇲🇴"], ["MP", "🇲🇵"], ["MQ", "🇲🇶"], ["MR", "🇲🇷"], ["MS", "🇲🇸"], ["MT", "🇲🇹"], ["MU", "🇲🇺"],
  ["MV", "🇲🇻"], ["MW", "🇲🇼"], ["MX", "🇲🇽"], ["MY", "🇲🇾"], ["MZ", "🇲🇿"], ["NA", "🇳🇦"], ["NC", "🇳🇨"], ["NE", "🇳🇪"], ["NF", "🇳🇫"], ["NG", "🇳🇬"],
  ["NI", "🇳🇮"], ["NL", "🇳🇱"], ["NO", "🇳🇴"], ["NP", "🇳🇵"], ["NR", "🇳🇷"], ["NU", "🇳🇺"], ["NZ", "🇳🇿"], ["OM", "🇴🇲"], ["PA", "🇵🇦"], ["PE", "🇵🇪"],
  ["PF", "🇵🇫"], ["PG", "🇵🇬"], ["PH", "🇵🇭"], ["PK", "🇵🇰"], ["PL", "🇵🇱"], ["PM", "🇵🇲"], ["PN", "🇵🇳"], ["PR", "🇵🇷"], ["PS", "🇵🇸"], ["PT", "🇵🇹"],
  ["PW", "🇵🇼"], ["PY", "🇵🇾"], ["QA", "🇶🇦"], ["RE", "🇷🇪"], ["RO", "🇷🇴"], ["RS", "🇷🇸"], ["RU", "🇷🇺"], ["RW", "🇷🇼"], ["SA", "🇸🇦"], ["SB", "🇸🇧"],
  ["SC", "🇸🇨"], ["SD", "🇸🇩"], ["SE", "🇸🇪"], ["SG", "🇸🇬"], ["SH", "🇸🇭"], ["SI", "🇸🇮"], ["SJ", "🇸🇯"], ["SK", "🇸🇰"], ["SL", "🇸🇱"], ["SM", "🇸🇲"],
  ["SN", "🇸🇳"], ["SO", "🇸🇴"], ["SR", "🇸🇷"], ["SS", "🇸🇸"], ["ST", "🇸🇹"], ["SV", "🇸🇻"], ["SX", "🇸🇽"], ["SY", "🇸🇾"], ["SZ", "🇸🇿"], ["TA", "🇹🇦"],
  ["TC", "🇹🇨"], ["TD", "🇹🇩"], ["TF", "🇹🇫"], ["TG", "🇹🇬"], ["TH", "🇹🇭"], ["TJ", "🇹🇯"], ["TK", "🇹🇰"], ["TL", "🇹🇱"], ["TM", "🇹🇲"], ["TN", "🇹🇳"],
  ["TO", "🇹🇴"], ["TR", "🇹🇷"], ["TT", "🇹🇹"], ["TV", "🇹🇻"], ["TW", "🇨🇳"], ["TZ", "🇹🇿"], ["UA", "🇺🇦"], ["UG", "🇺🇬"], ["UK", "🇬🇧"], ["UM", "🇺🇲"],
  ["US", "🇺🇸"], ["UY", "🇺🇾"], ["UZ", "🇺🇿"], ["VA", "🇻🇦"], ["VC", "🇻🇨"], ["VE", "🇻🇪"], ["VG", "🇻🇬"], ["VI", "🇻🇮"], ["VN", "🇻🇳"], ["VU", "🇻🇺"],
  ["WF", "🇼🇫"], ["WS", "🇼🇸"], ["XK", "🇽🇰"], ["YE", "🇾🇪"], ["YT", "🇾🇹"], ["ZA", "🇿🇦"], ["ZM", "🇿🇲"], ["ZW", "🇿🇼"]
]);

 const isp0 = "N/A";

 let obj = JSON.parse($response.body);

 const country = country_fix(country_check(obj['country']));
 const city = city_check(obj['city']);

 let title = (flags.get(obj['countryCode']) || '') + ' ' + country;
 let subtitle = obj['query'] + ' ' + isp_check(obj['as']);
 let ip = obj['query'];

 let asFull = obj['as'] || '';
 let asSplit = asFull.split(' ');
 let asNumber = asSplit[0] || 'N/A';
 let asOrganization = asSplit.slice(1).join(' ') || 'N/A';

 let description =
 obj['query'] + '\n' +
 asNumber + '\n' +
 asOrganization;

$done({ title, subtitle, ip, description });

 function country_check(para) {
 return para || '';
}

 function city_check(para) {
 if (!para) return '';
 const s = para.replace(/\s/g, '');
 return /^[a-zA-Z]+$/.test(s) ? '' : para;
}

 function isp_check(para) {
 return para || isp0;
}

 function country_fix(para) {
 const map = {
    "德意志联邦共和国": "德国",
    "大韩民国": "韩国",
    "South Korea": "韩国",
    "俄罗斯联邦": "俄罗斯",
    "美利坚合众国": "美国",
    "中国": "中国大陆",
    "澳门特别行政区": "澳门",
    "香港特别行政区": "香港",
    "中华民国": "台湾",
    "中華民國": "台湾",
    "刚果共和国": "刚果（布）",
    "刚果民主共和国": "刚果（金）",
    "扎伊尔": "刚果（金）",
    "中非": "中非共和国",
    "马其顿": "北马其顿",
    "象牙海岸": "科特迪瓦",
    "亞美尼亞": "亚美尼亚",
    "澳大利亞": "澳大利亚",
    "波黑": "波黑共和国",
    "留尼汪": "法属留尼汪",
    "阿鲁巴": "荷属阿鲁巴",
    "库拉索岛": "荷属库拉索",
    "圣马丁岛": "荷属圣马丁",
    "博奈尔岛、圣尤斯达蒂斯和萨巴": "荷属加勒比",
    "圣巴泰勒米岛": "圣巴泰勒米",
    "瓜德罗普": "法属瓜德罗普",
    "马提尼克": "法属马提尼克",
    "北马里亚纳": "北马里亚纳群岛",
    "马绍尔": "马绍尔群岛",
    "密克罗尼西亚联邦": "密克罗尼西亚",
    "印度尼西亚": "印尼",
  };
 return map[para] || para;
}
